## **[MySQL INSERT ON DUPLICATE KEY UPDATE](https://www.mysqltutorial.org/mysql-insert-or-update-on-duplicate-key-update/)**

Use MySQL INSERT ON DUPLICATE KEY UPDATE statement to update data if a duplicate in the UNIQUE index or PRIMARY KEY error occurs when you insert a row into a table.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    'display.max_colwidth', None,
    'display.max_rows', 10,
)

pd.set_option('display.width', 65)

In [2]:
# connect to the classicmodels database
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to the MySQL INSERT ON DUPLICATE KEY UPDATE statement

INSERT INTO table (column_list)
VALUES (value_list)
ON DUPLICATE KEY UPDATE
   c1 = v1, 
   c2 = v2,
   ...;

# sets the value of the c1 to its current value specified by the
# expression VALUES(c1) plus 1 if there is a dupplicate in UNIQUE
# index or PRIMARY KEY
INSERT INTO table_name(c1)
VALUES(c1)
ON DUPLICATE KEY UPDATE c1 = VALUES(c1) + 1;

### MySQL INSERT ON DUPLICATE KEY UPDATE example

In [3]:
# create  a table named devices
string = '''
CREATE TABLE devices (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100)
);'''

engine.execute('DROP TABLE IF EXISTS devices')
engine.execute(string)

# insert some data into it
string = '''
INSERT INTO devices (name)
VALUES ('Router F1'), ('Switch 1'), ('Switch 2')
;'''

engine.execute(string)

df1 = pd.read_sql('SELECT * FROM devices', engine)

df1

/tmp/ipykernel_7236/1659828132.py:8: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  engine.execute('DROP TABLE IF EXISTS devices')

   id       name
0   1  Router F1
1   2   Switch 1
2   3   Switch 2

In [4]:
df2 = pd.DataFrame(columns=['id', 'name'])

def change_type(df):
    df = df.assign(
        id = range(1, len(df)+1),
        name = df.name.str[:100])
    return df
          
row = {'name': ['Router F1', 'Switch 1', 'Switch 2']}

df2 = pd.concat([df2, pd.DataFrame.from_dict(row)]).pipe(change_type)

df2

   id       name
0   1  Router F1
1   2   Switch 1
2   3   Switch 2

Insert one more row into the `devices` table

In [5]:
string = '''
INSERT INTO devices (name)
VALUES ('Printer')
-- ON DUPLICATE KEY UPDATE name = 'Printer'
;'''

engine.execute(string)

df1 = pd.read_sql('SELECT * FROM devices', engine)

df1

   id       name
0   1  Router F1
1   2   Switch 1
2   3   Switch 2
3   4    Printer

In [6]:
row = {'name': ['Printer']}

df2 = (pd.concat([df2, pd.DataFrame.from_dict(row)],
                 ignore_index=True)
       .pipe(change_type))

df2

   id       name
0   1  Router F1
1   2   Switch 1
2   3   Switch 2
3   4    Printer

Insert a row with a duplicate value in the `id` column

In [7]:
string = '''
INSERT INTO devices (id, name)
VALUES (4, 'Printer')
ON DUPLICATE KEY UPDATE name = 'Central Printer'
;'''

engine.execute(string)

df1 = pd.read_sql('SELECT * FROM devices', engine)

engine.execute('DROP TABLE IF EXISTS devices')

df1

   id             name
0   1        Router F1
1   2         Switch 1
2   3         Switch 2
3   4  Central Printer

In [8]:
row = pd.DataFrame.from_dict({
    'id': [4], 'name': ['Central Printer']})

df2.loc[df2.id == 4, 'name'] = row.name.values

df2

   id             name
0   1        Router F1
1   2         Switch 1
2   3         Switch 2
3   4  Central Printer